.emacs.d/emacs.org
#+TITLE: Emacs Configuration
#+PROPERTY: header-args:emacs-lisp :tangle ./init.el

An attempt to collect everything necessary for comfortable work.

* Table of Contents
:PROPERTIES:
:TOC:      :include all :ignore this
:END:
:CONTENTS:
- [[#highlight-matching-braces][Highlight Matching Braces]]
- [[#displaying-world-time][Displaying World Time]]
- [[#pinentry][Pinentry]]
- [[#tramp][TRAMP]]
- [[#emacs-as-external-editor][Emacs as External Editor]]
- [[#editing-configuration][Editing Configuration]]
  - [[#tab-widths][Tab Widths]]
  - [[#use-spaces-instead-of-tabs-for-indentation][Use spaces instead of tabs for indentation]]
  - [[#commenting-lines][Commenting Lines]]
  - [[#automatically-clean-whitespace][Automatically clean whitespace]]
  - [[#use-parinfer-for-lispy-languages][Use Parinfer for Lispy languages]]
  - [[#origamiel-for-folding][Origami.el for Folding]]
- [[#completion-system][Completion System]]
  - [[#preserve-minibuffer-history-with-savehist-mode][Preserve Minibuffer History with savehist-mode]]
  - [[#completions-with-vertico][Completions with Vertico]]
  - [[#completions-in-regions-with-corfu][Completions in Regions with Corfu]]
  - [[#improved-candidate-filtering-with-orderless][Improved Candidate Filtering with Orderless]]
  - [[#completions-with-icomplete][Completions with icomplete]]
  - [[#consult-commands][Consult Commands]]
  - [[#completion-annotations-with-marginalia][Completion Annotations with Marginalia]]
  - [[#completion-actions-with-embark][Completion Actions with Embark]]
  - [[#selectrum][Selectrum]]
- [[#expand-region][Expand Region]]
- [[#credential-management][Credential Management]]
- [[#file-browsing][File Browsing]]
  - [[#dired][Dired]]
  - [[#opening-files-externally][Opening Files Externally]]
- [[#org-mode][Org Mode]]
  - [[#org-configuration][Org Configuration]]
  - [[#workflow-configuration][Workflow Configuration]]
  - [[#fonts-and-bullets][Fonts and Bullets]]
  - [[#block-templates][Block Templates]]
  - [[#protocol][Protocol]]
  - [[#searching][Searching]]
  - [[#bindings][Bindings]]
  - [[#update-table-of-contents-on-save][Update Table of Contents on Save]]
  - [[#calendar-sync][Calendar Sync]]
  - [[#reminders][Reminders]]
  - [[#presentations][Presentations]]
    - [[#org-present][org-present]]
    - [[#org-tree-slide][org-tree-slide]]
  - [[#org-roam][Org Roam]]
:END:
* StartUp
** Package Management
#+begin_src emacs-lisp
  (setq package-list '(shackle company org ox-reveal which-key diminish magit
                               rainbow-mode rainbow-delimiters ws-butler tramp impatient-mode
                               pdf-tools flycheck git-commit git-messenger company-prescient no-littering auctex))

  (setq package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
                           ("elpa" . "https://elpa.gnu.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("melpa" . "https://melpa.org/packages/")
                           ("melpa-stable" . "https://stable.melpa.org/packages/")))

  (package-initialize)

  (unless package-archive-contents
    (package-refresh-contents))

  (dolist (package package-list)
    (unless (package-installed-p package)
      (package-install package)))
#+end_src

** Custom Elisp
#+begin_src emacs-lisp
  (defmacro defkeys (mapname &rest body)
    `(let ((defs '(,@body)))
       (while defs
         (define-key ,mapname
           (if (vectorp (car defs))
               (car defs)
             (read-kbd-macro (car defs)))
           (if (or (listp (cadr defs)) (functionp (cadr defs)))
               (cadr defs)
             (if `(keymapp (bound-and-true-p ,(cadr defs)))
                 (eval (cadr defs)))))
         (setq defs (cddr defs)))))
#+end_src

** Start Emacs as a server
#+begin_src emacs-lisp
  (server-start)
#+end_src

** OS settings
#+begin_src emacs-lisp
  (defun win_setup ()
    (if (not (file-exists-p "emacs.bat"))
        (progn (with-temp-file "emacs.bat"
                 (insert "@echo off\n\"C:\\Program Files (x86)\\emacs\\bin\\runemacs.exe\" -q -l \"C:\\.emacs.d\\init.el\""))
               (setenv "PATH"
                       (concat
                        "C:\\Windows\\system32" path-separator
                        "C:\\.emacs.d\\" path-separator
                        ))
               (shell-command (format "setx PATH %s"(getenv "PATH")))
               )
      )
    )

  (cond  ((string-equal system-type "windows-nt") 'win_setup)
         ((string-equal system-type "darwin") nil)
         ((string-equal system-type "gnu/linux") nil)
         ((string-equal system-type "gnu/kfreebsd") nil)
         ((string-equal system-type "berkeley-unix") nil)
         ((string-equal system-type "cygwin") nil)
         )
#+end_src

** Coding-system settings
#+begin_src emacs-lisp
  (setq-default coding-system-for-read    'utf-8)
  (setq file-name-coding-system           'utf-8)
  (set-selection-coding-system            'utf-8)
  (set-keyboard-coding-system        'utf-8-unix)
  (set-terminal-coding-system             'utf-8)
  (prefer-coding-system                   'utf-8)
#+end_src

** Auto Mode Alist
AssociationList that associates MajorModes with a pattern to match a buffer filename when it is first opened.
#+begin_src emacs-lisp
  (setq auto-mode-alist
        (append '(("\\.txt$" . indented-text-mode)
                  ("\\`/tmp/fol/" . text-mode)
                  ("\\.texinfo\\'" . texinfo-mode)
                  ("\\.texi\\'" . texinfo-mode)
                  ("\\.el\\'" . emacs-lisp-mode)
                  ("\\.c\\'" . c-mode)
                  ("\\.h\\'" . c-mode)
                  ("\\.gen$" . gen-mode)
                  ("\\.ms$" . fundamental-mode)
                  ("\\.mm$" . objc-mode)
                  ("\\.m$" . objc-mode)
                  ("\\.sh\\'" . shell-script-mode)
                  ("\\.jpe?g\\'" . image-mode)
                  ("\\.bat\\'" . bat-mode)
                  ("\\.[Bb][Aa][Tt]\\'" . bat-mode)
                  ("\\.\\(BAT\\||bat\\)\\'" . bat-mode)
                  ("_EDITMSG\\'" . log-entry-mode)
                  ("/cvs[[:alnum:]]*\\'" . log-entry-mode))
                auto-mode-alist))
#+end_src

* Keybinding
** Panel (which-key)
#+begin_src emacs-lisp
  (require 'which-key)
  (setq which-key-idle-delay 0.3)
  (which-key-mode 1)
#+end_src

** ESC Cancels All
#+begin_src emacs-lisp
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
#+end_src

* General Configuration
** User Interface
Make emacs more minimal.
#+begin_src emacs-lisp
  (setq inhibit-startup-message t
        visible-bell t
        next-line-add-newlines nil
        truncate-partial-width-windows nil
        ring-bell-function 'ignore
        gc-cons-threshold 50000000)

  (scroll-bar-mode -1)
  (tool-bar-mode 0)
  (tooltip-mode 0)
  (set-fringe-mode 10)
  (menu-bar-mode 0)
  (display-time-mode t)
  (display-battery-mode t)
  (blink-cursor-mode 0)
  (global-hl-line-mode 1)

  (custom-set-variables
   '(auto-save-default nil)
   '(auto-save-interval 0)
   '(auto-save-list-file-name nil)
   '(auto-save-list-file-prefix nil)
   '(auto-save-timeout 0)
   '(delete-auto-save-files nil)
   '(delete-old-versions (quote other))
   '(kept-new-versions 5)
   '(kept-old-versions 5)
   '(make-backup-file-name-function (quote ignore))
   '(make-backup-files nil)
   '(mouse-wheel-progressive-speed nil)
   '(mouse-wheel-scroll-amount (quote (15)))
   '(version-control nil))

  (setq undo-limit 20000000
        undo-strong-limit 40000000)
#+end_src
Improve scrolling.
#+begin_src emacs-lisp
  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))
        mouse-wheel-progressive-speed nil
        mouse-wheel-follow-mouse 't
        scroll-step 3
        use-dialog-box nil)
#+end_src
Enable line numbers and customize their format.
#+begin_src emacs-lisp
  (column-number-mode)
  (dolist (mode '(text-mode-hook
                  prog-mode-hook
                  conf-mode-hook
                  org-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))
#+end_src
Don’t warn for large files (shows up when launching videos)
#+begin_src emacs-lisp
  (setq large-file-warning-threshold nil)
#+end_src
Don’t warn for following symlinked files
#+begin_src emacs-lisp
  (setq vc-follow-symlinks t)
#+end_src
Don’t warn when advice is added for functions
#+begin_src emacs-lisp
  (setq ad-redefinition-action 'accept)
#+end_src
Replacing tabs with spaces and setting indent width values to 4 units
#+begin_src emacs-lisp
  (setq-default indent-tabs-mode nil
                tab-always-indent nil
                tab-width 4)
#+end_src

