.emacs.d/init.el
  (setq package-list '(shackle company org ox-reveal which-key diminish magit irony company-irony
                               irony-eldoc rtags cmake-ide rainbow-mode rainbow-delimiters ws-butler
                               impatient-mode tramp flycheck git-commit git-messenger company-prescient no-littering))

  (setq package-archives '(("gnu" . "https://elpa.gnu.org/packages/")
                           ("elpa" . "https://elpa.gnu.org/packages/")
                           ("org" . "https://orgmode.org/elpa/")
                           ("melpa" . "https://melpa.org/packages/")
                           ("melpa-stable" . "https://stable.melpa.org/packages/")))

  (package-initialize)

  (unless package-archive-contents
    (package-refresh-contents))

  (dolist (package package-list)
    (unless (package-installed-p package)
      (package-install package)))



  (defmacro defkeys (mapname &rest body)
    `(let ((defs '(,@body)))
       (while defs
         (define-key ,mapname
           (if (vectorp (car defs))
               (car defs)
             (read-kbd-macro (car defs)))
           (if (or (listp (cadr defs)) (functionp (cadr defs)))
               (cadr defs)
             (if `(keymapp (bound-and-true-p ,(cadr defs)))
                 (eval (cadr defs)))))
         (setq defs (cddr defs)))))



  (server-start)



  (defun win_setup ()
    (if (not (file-exists-p "emacs.bat"))
        (progn (with-temp-file "emacs.bat"
                 (insert "@echo off\n\"C:\\Program Files (x86)\\emacs\\bin\\runemacs.exe\" -q -l \"C:\\.emacs.d\\init.el\""))
               (setenv "PATH"
                       (concat
                        "C:\\Windows\\system32" path-separator
                        "C:\\.emacs.d\\" path-separator
                        ))
               (shell-command (format "setx PATH %s"(getenv "PATH")))
               )
      )
    )

  (cond  ((string-equal system-type "windows-nt") 'win_setup)
         ((string-equal system-type "darwin") nil)
         ((string-equal system-type "gnu/linux") nil)
         ((string-equal system-type "gnu/kfreebsd") nil)
         ((string-equal system-type "berkeley-unix") nil)
         ((string-equal system-type "cygwin") nil)
         )



  (setq-default coding-system-for-read    'utf-8)
  (setq file-name-coding-system           'utf-8)
  (set-selection-coding-system            'utf-8)
  (set-keyboard-coding-system        'utf-8-unix)
  (set-terminal-coding-system             'utf-8)
  (prefer-coding-system                   'utf-8)



  (setq auto-mode-alist
        (append '(("\\.txt$" . indented-text-mode)
                  ("\\`/tmp/fol/" . text-mode)
                  ("\\.texinfo\\'" . texinfo-mode)
                  ("\\.texi\\'" . texinfo-mode)
                  ("\\.el\\'" . emacs-lisp-mode)
                  ("\\.c\\'" . c-mode)
                  ("\\.h\\'" . c-mode)
                  ("\\.gen$" . gen-mode)
                  ("\\.ms$" . fundamental-mode)
                  ("\\.mm$" . objc-mode)
                  ("\\.m$" . objc-mode)
                  ("\\.sh\\'" . shell-script-mode)
                  ("\\.jpe?g\\'" . image-mode)
                  ("\\.bat\\'" . bat-mode)
                  ("\\.[Bb][Aa][Tt]\\'" . bat-mode)
                  ("\\.\\(BAT\\||bat\\)\\'" . bat-mode)
                  ("_EDITMSG\\'" . log-entry-mode)
                  ("/cvs[[:alnum:]]*\\'" . log-entry-mode))
                auto-mode-alist))


  (require 'which-key)
  (setq which-key-idle-delay 0.3)
  (which-key-mode 1)



  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)



  (setq inhibit-startup-message t
        visible-bell t
        next-line-add-newlines nil
        truncate-partial-width-windows nil
        ring-bell-function 'ignore
        gc-cons-threshold 50000000)

  (scroll-bar-mode -1)
  (tool-bar-mode 0)
  (tooltip-mode 0)
  (set-fringe-mode 10)
  (menu-bar-mode 0)
  (display-time-mode t)
  (display-battery-mode t)
  (blink-cursor-mode 0)
  (global-hl-line-mode 1)

  (custom-set-variables
   '(auto-save-default nil)
   '(auto-save-interval 0)
   '(auto-save-list-file-name nil)
   '(auto-save-list-file-prefix nil)
   '(auto-save-timeout 0)
   '(delete-auto-save-files nil)
   '(delete-old-versions (quote other))
   '(kept-new-versions 5)
   '(kept-old-versions 5)
   '(make-backup-file-name-function (quote ignore))
   '(make-backup-files nil)
   '(mouse-wheel-progressive-speed nil)
   '(mouse-wheel-scroll-amount (quote (15)))
   '(version-control nil))

  (setq undo-limit 20000000
        undo-strong-limit 40000000)


  (setq mouse-wheel-scroll-amount '(1 ((shift) . 1))
        mouse-wheel-progressive-speed nil
        mouse-wheel-follow-mouse 't
        scroll-step 3
        use-dialog-box nil)


  (column-number-mode)
  (dolist (mode '(text-mode-hook
                  prog-mode-hook
                  conf-mode-hook
                  org-mode-hook))
    (add-hook mode (lambda () (display-line-numbers-mode 0))))


  (setq large-file-warning-threshold nil)


  (setq vc-follow-symlinks t)


  (setq ad-redefinition-action 'accept)


  (setq-default indent-tabs-mode nil
                tab-always-indent nil
                tab-width 4)
