.emacs.d/init.el



  (set-face-attribute 'default nil :font "DejaVu Sans Mono" :height 110 :foreground "#fdf4c1" :background "#282828")
  (set-face-attribute 'cursor t :background "#fdf4c1")
  (set-face-attribute 'highlight t :background "#333333")
  (set-face-attribute 'hl-line t :background "#333333")
  (set-face-attribute 'fringe t :background "#282828")
  (set-face-attribute 'mode-line t :foreground "#262626" :background "#FE8019")
  (set-face-attribute 'region t :background "#504945")
  (set-face-attribute 'secondary-selection t :background "#3e3834")
  (set-face-attribute 'font-lock-builtin-face t :foreground "#fe8019")
  (set-face-attribute 'font-lock-comment-face t :foreground "#7c6f64")
  (set-face-attribute 'font-lock-function-name-face t :foreground "#a99865")
  (set-face-attribute 'font-lock-keyword-face t :foreground "#dd6f48")
  (set-face-attribute 'font-lock-string-face t :foreground "#429489")
  (set-face-attribute 'font-lock-type-face t :foreground "#66999d")
  (set-face-attribute 'font-lock-constant-face t :foreground "#bbaa97")
  (set-face-attribute 'font-lock-variable-name-face t :foreground "#83a598")
  (set-face-attribute 'minibuffer-prompt t :foreground "#75b45c" :bold t)
  (set-face-attribute 'font-lock-warning-face t :foreground "#ff0000" :bold t)



  (customize-set-variable 'display-time-string-forms
                          '((propertize (concat dayname
                                                " " 12-hours ":" minutes " " (upcase am-pm)))))



  (display-time-update)



  (setq global-mode-string (delq 'display-time-string global-mode-string))



  (setq global-mode-string (delq 'battery-mode-line-string global-mode-string))



  (defun mode-line-fill (reserve)
    "Return empty space using FACE and leaving RESERVE space on the right."
    (unless reserve
      (setq reserve 20))
    (when (and window-system
               (eq 'right (get-scroll-bar-mode)))
      (setq reserve (- reserve 3)))
    (propertize " "
                'display `((space :align-to (- (+ right right-fringe right-margin) ,reserve)))))

  (customize-set-variable 'mode-line-format
                          '("%e"
                            mode-line-front-space
                            mode-line-client
                            mode-line-remote
                            mode-line-mule-info
                            mode-line-modified
                            "  "
                            ;; Buffer name
                            (:propertize "%b " 'face nil)

                            ;; line and column
                            "["
                            (:propertize "%l" 'face nil)
                            ","
                            (:propertize "%c" 'face nil)
                            "]"

                            ;; relative position, size of file
                            "["
                            (:propertize "%p" 'face nil)
                            "/"
                            (:propertize "%I" 'face nil)
                            "] "

                            ;; the current major mode for the buffer.
                            "["
                            (:propertize "%m" 'face nil
                                         'help-echo buffer-file-coding-system)
                            "] "

                            "["
                            ;; insert vs overwrite mode, input-method in a tooltip
                            (:eval (propertize (if overwrite-mode "Ovr" "Ins")
                                               'face nil))

                            ;; was this buffer modified since the last save?
                            (:eval (when (buffer-modified-p)
                                     (concat "," (propertize "Mod"
                                                             'face nil))))

                            ;; is this buffer read-only?
                            (:eval (when buffer-read-only
                                     (concat "," (propertize "RO"
                                                             'face nil))))
                            "] "

                            ;; Version control
                            (:eval (when vc-mode
                                     (concat " " vc-mode)))

                            (:eval (mode-line-fill (+ (length battery-mode-line-string)
                                                      3
                                                      (length display-time-string))))
                            battery-mode-line-string
                            " "
                            display-time-string
                            ))



  (require 'diminish)

  (diminish 'which-key-mode)
  (diminish 'hungry-delete-mode)
  (diminish 'beacon-mode)
  (diminish 'rainbow-mode)
  (diminish 'super-save-mode)
  (diminish 'visual-line-mode)
  (diminish 'org-indent-mode)
  (diminish 'ws-butler-mode)
  (diminish 'buffer-face-mode)
  (diminish 'eldoc-mode)
  (diminish 'company-mode)



  ;; Change the user-emacs-directory to keep unwanted things out of ~/.emacs.d
  (setq user-emacs-directory (expand-file-name "~/.cache/emacs/")
        url-history-file (expand-file-name "url/history" user-emacs-directory))

  ;; Use no-littering to automatically set common paths to the new user-emacs-directory
  (require 'no-littering)

  ;; Keep customization settings in a temporary file (thanks Ambrevar!)
  (setq custom-file
        (if (boundp 'server-socket-dir)
            (expand-file-name "custom.el" server-socket-dir)
          (expand-file-name (format "emacs-custom-%s.el" (user-uid)) temporary-file-directory)))
  (load custom-file t)



  (require 'ws-butler)
  (add-hook 'text-mode-hook 'ws-butler-mode)
  (add-hook 'prog-mode-hook 'ws-butler-mode)



  (defadvice ido-find-file (after find-file-sudo activate)
    "Find file as root if necessary."
    (unless (and buffer-file-name
                 (file-writable-p buffer-file-name))
      (let* ((file-name (buffer-file-name))
             (file-root (if (string-match "/ssh:\\([^:]+\\):\\(.*\\)" file-name)
                            (concat "/ssh:"  (match-string 1 file-name)
                                    "|doas:" (match-string 1 file-name)
                                    ":"      (match-string 2 file-name))
                          (concat "/doas:localhost:" file-name))))
        (find-alternate-file file-root))))

  (require 'ido)
  (ido-mode 1)

  (setq ido-everywhere t
        ido-enable-flex-matching t
        ido-create-new-buffer 'always
        ido-default-file-method 'selected-window
        ido-default-buffer-method 'selected-window)

  (define-key (cdr ido-minor-mode-map-entry) [remap write-file] nil)
  (global-set-key (kbd "C-x C-f") 'ido-find-file)




  (setq-default fill-column 80)
  (defun org_mode_setup ()
    (org-indent-mode)
    (variable-pitch-mode 1)
    (auto-fill-mode 0)
    (visual-line-mode 1)
    (setq evil-auto-indent nil)
    (diminish org-indent-mode))

  (require 'org)
  (add-hook 'org-mode-hook 'org_mode_setup)

  (org-babel-do-load-languages 'org-babel-load-languages
                               '((emacs-lisp . t)))



  (require 'org-tempo)
  (add-to-list 'org-structure-template-alist '("sh" . "src sh"))
  (add-to-list 'org-structure-template-alist '("el" . "src emacs-lisp"))
  (add-to-list 'org-structure-template-alist '("em" . "src"))
