.emacs.d/emacs.org
** Org-Reveal
Reveal.js is a tool for creating good-looking HTML presentations. Org-Reveal exports your Org documents to reveal.js presentations. With Org-reveal, you can create beautiful presentations with 3D effects from simple but powerful Org contents.
#+begin_src emacs-lisp
  (require 'ox-reveal)
#+end_src

** Auto-Reverting Changed Files
#+begin_src emacs-lisp
  (global-auto-revert-mode 1)
#+end_src

* File header formatting
#+begin_src emacs-lisp
; CC++ mode handling
(defun vk_c_hook ()
  ; Abbrevation expansion
  (abbrev-mode 1)

  (defun vk_header_format ()
     "Format the given file as a header file."
     (interactive)
     (setq BaseFileName (file-name-sans-extension (file-name-nondirectory buffer-file-name)))
     (insert "#if !defined(")
     (push-mark)
     (insert BaseFileName)
     (upcase-region (mark) (point))
     (pop-mark)
     (insert "_H)\n")
     (insert "/* ========================================================================\n")
     (insert " * $File: $\n")
     (insert " * $Date: $\n")
     (insert " * $Revision: $\n")
     (insert " * $Creator: Vladislav Kvach $\n")
     (insert " * ========================================================================\n")
     (insert " */")
     (insert "\n")
     (insert "#define ")
     (push-mark)
     (insert BaseFileName)
     (upcase-region (mark) (point))
     (pop-mark)
     (insert "_H\n")
     (insert "#endif"))

  (defun vk_source_format ()
     "Format the given file as a source file."
     (interactive)
     (setq BaseFileName (file-name-sans-extension (file-name-nondirectory buffer-file-name)))
     (insert "/* ========================================================================\n")
     (insert " * $File: $\n")
     (insert " * $Date: $\n")
     (insert " * $Revision: $\n")
     (insert " * $Creator: Vladislav Kvach $\n")
     (insert " * ========================================================================\n")
     (insert " */")
     (insert "\n"))

    (cond ((file-exists-p buffer-file-name) t)
          ((string-match "[.]c" buffer-file-name) (vk_source_format))
          ((string-match "[.]h" buffer-file-name) (vk_header_format)))
)

(add-hook 'c-mode-common-hook 'vk_c_hook)
#+end_src

** Flycheck
#+begin_src emacs-lisp
  (require 'flycheck)
#+end_src

** HTML/CSS
#+begin_src emacs-lisp
  (require 'rainbow-mode)
  (add-hook 'org-mode-hook 'rainbow-mode)

  (require 'impatient-mode)
#+end_src
** TRAMP (Transparent Remote Access, Multiple Protocols)
#+begin_src emacs-lisp
  (require 'tramp)
  (setq tramp-default-method "ssh"
        tramp-persistency-file-name (concat no-littering-var-directory "tramp")
        tramp-auto-save-directory (concat no-littering-var-directory "tramp-autosave")
        tramp-verbose 10
        tramp-shell-prompt-pattern "\\(?:^\\|\r\\)[^]#$%>\n]*#?[]#$%>] *\\(^[\\[[0-9;]*[a-zA-Z] *\\)*")
  (tramp-set-completion-function "ssh" '((tramp-parse-sconfig "/etc/ssh_config")
                                         (tramp-parse-sconfig "~/.ssh/config")))
#+end_src
** Git
#+begin_src emacs-lisp
  (require 'magit)
  (require 'git-commit)
  (require 'git-messenger)

  (add-hook 'git-commit-mode-hook 'my-american-dict)

  (setq git-messenger:show-detail t
        git-messenger:use-magit-popup t)

  (defkeys global-map
    "C-x g" magit-status
    "C-x M-g" magit-dispatch
    "C-x G" git-messenger:popup-message)
#+end_src

** Company
[[http://company-mode.github.io/][Company Mode]] provides a nicer in-buffer completion interface than =completion-at-point= which is more reminiscent of what you would expect from an IDE.  We add a simple configuration to make the keybindings a little more useful (=TAB= now completes the selection and initiates completion at the current location if needed).

We also use [[https://github.com/sebastiencs/company-box][company-box]] to further enhance the look of the completions with icons and better overall presentation.

#+begin_src emacs-lisp
  (require 'company)

  (add-hook 'after-init-hook 'global-company-mode)
  (define-key company-active-map (kbd "C-n") 'company-select-next)
  (define-key company-active-map (kbd "M->") 'company-select-last)
  (define-key company-active-map (kbd "M-<") 'company-select-first)
  (define-key company-active-map (kbd "C-p") 'company-select-previous)
  (define-key company-active-map (kbd "<tab>") 'company-complete-selection)
  (define-key prog-mode-map (kbd "<tab>") 'company-indent-or-complete-common)

  (setq company-idle-delay 0.0
        company-async-timeout 15
        company-tooltip-align-annotations t
        company-show-numbers t
        company-global-modes '(not shell-mode eaf-mode)
        company-require-match 'never
        company-tooltip-align-annotations t
        company-minimum-prefix-length 1)

  (company-mode 1)

  (with-eval-after-load 'company
    (require 'company-prescient)
    (company-prescient-mode 1))
#+end_src

* Productivity
** PDF Tools
PDF Tools is, among other things, a replacement of DocView for PDF files. The key difference is that pages are not pre-rendered by e.g. ghostscript and stored in the file-system, but rather created on-demand and stored in memory.
#+begin_src emacs-lisp
  (require 'pdf-tools)
  (pdf-loader-install)

  (setq pdf-misc-print-programm "/usr/bin/gtklp"
        pdf-misc-print-programm-args (quote ("-o media=A4" "-o fitplot"))
        pdf-view-display-size 'fit-page
        pdf-view-midnight-colors '("white smoke" . "gray5"))
#+end_src
** Rainbow Delimiters
#+begin_src emacs-lisp
  (require 'rainbow-delimiters)
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)
#+end_src

** Rainbow Mode
#+begin_src emacs-lisp
  (require 'rainbow-mode)
  (add-hook 'css-mode-hook 'rainbow-mode)
#+end_src

** Shackle
Shackle gives you the means to put an end to popped up buffers not behaving they way you'd like them to. By setting up simple rules you can for instance make Emacs always select help buffers for you or make everything reuse your currently selected window.
#+begin_src emacs-lisp
  (require 'shackle)
  (setq shackle-default-size 0.4
        shackle-rules
        '(("*Calendar*" :select t :size 0.3 :align below)
          ("*Compile-Log*" :ignore t)
          ("*Completions*" :size 0.3  :align t)
          ("*Help*" :select t :inhibit-window-quit t :other t)
          ("*Messages*" :select nil :inhibit-window-quit t :other t)
          ("*Process List*" :select t :size 0.3 :align below)
          ("*Python*" :select t :size 0.3 :align bellow)
          ("*Shell Command Output*" :select nil)
          ("*Warnings*" :ignore t)
          ("*el-get bootstrap*" :ignore t)
          ("*undo-tree*" :size 0.25 :align left)
          ("\\*Async Shell.*\\*" :regexp t :ignore t)
          ("\\*[Wo]*Man.*\\*" :regexp t :select t :inhibit-window-quit t :other t)
          ("\\*poporg.*\\*" :regexp t :select t :other t)
          ("\\*shell*\\*" :regexp t :same t :select t :other t)
          ("\\`\\*ivy.*?\\*\\'" :regexp t :size 0.3 :align t)
          ("edbi-dbviewer" :regexp t :select t :same t)
          ("*edbi:query-result" :regexp t :size 0.8 :align bellow)
          (occur-mode :select nil :align t)
          (pdf-view-mode :other t)
          (compilation-mode :select nil)
          ("\\*Apropos\\|Help\\|Occur\\|tide-references\\*" :regexp t :same t :select t :inhibit-window-quit t)
          ("\\*magit" :regexp t :same t :select t)
          ("\\*PowerShell.*" :regexp t :same t :select t)
          ("*go-guru-output*" :select t :same t)
          ("*Proced*" :select t :same t)
          ("\\*Pp Eval" :regexp t :same nil :select t :other t)
          ("*slime-source*" :select nil :same nil :other t)
          ("*slime-description*" :select nil :other t :inhibit-window-quit t)
          ("\\*slime-repl" :regexp t :same nil :select nil :other t)
          ("\\*sldb" :regexp t :other t :inhibit-window-quit t :select t)
          ("\\*slime-compilation" :regexp t :same nil :select nil :other t)
          ("*slime-scratch*" :same nil :select t :other t)
          ("*ert*" :select nil :same nil :other t)
          ("*sesman CIDER browser*" :inhibit-window-quit t :select t :same t)
          ("\\*cider-repl" :regexp t :same nil :other t)
          ("*Buffer List*" :select t :same t)))
  (shackle-mode 1)
#+end_src

* LaTex
** AucTex
#+begin_src emacs-lisp
  (setq TeX-view-program-selection '((output-pdf "PDF Tools"))
        TeX-view-program-list '(("PDF Tools" TeX-pdf-tools-sync-view))
        TeX-source-correlate-start-server t
        TeX-auto-save t
        TeX-parse-self t)

  (add-hook 'TeX-after-compilation-finished-functions
            #'TeX-revert-document-buffer)

  (add-hook 'pdf-view-mode-hook (lambda() (linum-mode -1)))
#+end_src
