.emacs.d/init.el



  (require 'ox-reveal)



  (global-auto-revert-mode 1)



; CC++ mode handling
(defun vk_c_hook ()
  ; Abbrevation expansion
  (abbrev-mode 1)

  (defun vk_header_format ()
     "Format the given file as a header file."
     (interactive)
     (setq BaseFileName (file-name-sans-extension (file-name-nondirectory buffer-file-name)))
     (insert "#if !defined(")
     (push-mark)
     (insert BaseFileName)
     (upcase-region (mark) (point))
     (pop-mark)
     (insert "_H)\n")
     (insert "/* ========================================================================\n")
     (insert " * $File: $\n")
     (insert " * $Date: $\n")
     (insert " * $Revision: $\n")
     (insert " * $Creator: Vladislav Kvach $\n")
     (insert " * ========================================================================\n")
     (insert " */")
     (insert "\n")
     (insert "#define ")
     (push-mark)
     (insert BaseFileName)
     (upcase-region (mark) (point))
     (pop-mark)
     (insert "_H\n")
     (insert "#endif"))

  (defun vk_source_format ()
     "Format the given file as a source file."
     (interactive)
     (setq BaseFileName (file-name-sans-extension (file-name-nondirectory buffer-file-name)))
     (insert "/* ========================================================================\n")
     (insert " * $File: $\n")
     (insert " * $Date: $\n")
     (insert " * $Revision: $\n")
     (insert " * $Creator: Vladislav Kvach $\n")
     (insert " * ========================================================================\n")
     (insert " */")
     (insert "\n"))

    (cond ((file-exists-p buffer-file-name) t)
          ((string-match "[.]c" buffer-file-name) (vk_source_format))
          ((string-match "[.]h" buffer-file-name) (vk_header_format)))
)

(add-hook 'c-mode-common-hook 'vk_c_hook)



  (require 'flycheck)



  (require 'rainbow-mode)
  (add-hook 'org-mode-hook 'rainbow-mode)

  (require 'impatient-mode)


  (require 'tramp)
  (setq tramp-default-method "ssh"
        tramp-persistency-file-name (concat no-littering-var-directory "tramp")
        tramp-auto-save-directory (concat no-littering-var-directory "tramp-autosave")
        tramp-verbose 10
        tramp-shell-prompt-pattern "\\(?:^\\|\r\\)[^]#$%>\n]*#?[]#$%>] *\\(^[\\[[0-9;]*[a-zA-Z] *\\)*")
  (tramp-set-completion-function "ssh" '((tramp-parse-sconfig "/etc/ssh_config")
                                         (tramp-parse-sconfig "~/.ssh/config")))


  (require 'magit)
  (require 'git-commit)
  (require 'git-messenger)

  (add-hook 'git-commit-mode-hook 'my-american-dict)

  (setq git-messenger:show-detail t
        git-messenger:use-magit-popup t)

  (defkeys global-map
    "C-x g" magit-status
    "C-x M-g" magit-dispatch
    "C-x G" git-messenger:popup-message)



  (require 'company)

  (add-hook 'after-init-hook 'global-company-mode)
  (define-key company-active-map (kbd "C-n") 'company-select-next)
  (define-key company-active-map (kbd "M->") 'company-select-last)
  (define-key company-active-map (kbd "M-<") 'company-select-first)
  (define-key company-active-map (kbd "C-p") 'company-select-previous)
  (define-key company-active-map (kbd "<tab>") 'company-complete-selection)
  (define-key prog-mode-map (kbd "<tab>") 'company-indent-or-complete-common)

  (setq company-idle-delay 0.0
        company-async-timeout 15
        company-tooltip-align-annotations t
        company-show-numbers t
        company-global-modes '(not shell-mode eaf-mode)
        company-require-match 'never
        company-tooltip-align-annotations t
        company-minimum-prefix-length 2)

  (company-mode 1)

  (with-eval-after-load 'company
    (require 'company-prescient)
    (company-prescient-mode 1)
    (require 'company-irony))



  (require 'rainbow-delimiters)
  (add-hook 'prog-mode-hook 'rainbow-delimiters-mode)



  (require 'rainbow-mode)
  (add-hook 'css-mode-hook 'rainbow-mode)


  (require 'shackle)
  (setq shackle-default-size 0.4
        shackle-rules
        '(("*Calendar*" :select t :size 0.3 :align below)
          ("*Compile-Log*" :ignore t)
          ("*Completions*" :size 0.3  :align t)
          ("*Help*" :select t :inhibit-window-quit t :other t)
          ("*Messages*" :select nil :inhibit-window-quit t :other t)
          ("*Process List*" :select t :size 0.3 :align below)
          ("*Python*" :select t :size 0.3 :align bellow)
          ("*Shell Command Output*" :select nil)
          ("*Warnings*" :ignore t)
          ("*el-get bootstrap*" :ignore t)
          ("*undo-tree*" :size 0.25 :align left)
          ("\\*Async Shell.*\\*" :regexp t :ignore t)
          ("\\*[Wo]*Man.*\\*" :regexp t :select t :inhibit-window-quit t :other t)
          ("\\*poporg.*\\*" :regexp t :select t :other t)
          ("\\*shell*\\*" :regexp t :same t :select t :other t)
          ("\\`\\*ivy.*?\\*\\'" :regexp t :size 0.3 :align t)
          ("edbi-dbviewer" :regexp t :select t :same t)
          ("*edbi:query-result" :regexp t :size 0.8 :align bellow)
          (occur-mode :select nil :align t)
          (pdf-view-mode :other t)
          (compilation-mode :select nil)
          ("\\*Apropos\\|Help\\|Occur\\|tide-references\\*" :regexp t :same t :select t :inhibit-window-quit t)
          ("\\*magit" :regexp t :same t :select t)
          ("\\*PowerShell.*" :regexp t :same t :select t)
          ("*go-guru-output*" :select t :same t)
          ("*Proced*" :select t :same t)
          ("\\*Pp Eval" :regexp t :same nil :select t :other t)
          ("*slime-source*" :select nil :same nil :other t)
          ("*slime-description*" :select nil :other t :inhibit-window-quit t)
          ("\\*slime-repl" :regexp t :same nil :select nil :other t)
          ("\\*sldb" :regexp t :other t :inhibit-window-quit t :select t)
          ("\\*slime-compilation" :regexp t :same nil :select nil :other t)
          ("*slime-scratch*" :same nil :select t :other t)
          ("*ert*" :select nil :same nil :other t)
          ("*sesman CIDER browser*" :inhibit-window-quit t :select t :same t)
          ("\\*cider-repl" :regexp t :same nil :other t)
          ("*Buffer List*" :select t :same t)))
  (shackle-mode 1)


(load "./include/c.el")
(provide 'init)
;;; init.el ends here
